; domain
(define (domain imv)
  (:requirements :strips :typing)
  (:types location artifact robot)
  (:predicates
    (robot_at ?l - location)
    (artifact_at ?a - artifact ?l - location)
    (robot_carrying ?a - artifact)
    (empty ?r - robot)
    (connected ?from ?to - location)
  )
  (:action move
    :parameters (?from ?to - location)
    :precondition (and (robot_at ?from) (connected ?from ?to))
    :effect (and (not (robot_at ?from)) (robot_at ?to))
  )
  (:action load
    :parameters (?r - robot ?a - artifact ?l - location)
    :precondition (and (robot_at ?l) (artifact_at ?a ?l) (empty ?r))
    :effect (and (not (empty ?r)) (robot_carrying ?a) (not (artifact_at ?a ?l)))
  )
  (:action unload
    :parameters (?r - robot ?a - artifact ?l - location)
    :precondition (and (robot_at ?l) (robot_carrying ?a))
    :effect (and (empty ?r) (artifact_at ?a ?l) (not (robot_carrying ?a)))
  )
)

; problem
(define (problem imv-p01)
  (:domain imv)
  (:objects
    entrance tunnel hallA hallB cryo pod1 pod2 stasis - location
    a1 a2 b1 b2 cs1 cs2 - artifact
    r1 - robot
  )
  (:init
    (robot_at entrance)
    (empty r1)

    (artifact_at a1 hallA)
    (artifact_at a2 hallA)
    (artifact_at b1 hallB)
    (artifact_at b2 hallB)
    (artifact_at cs1 cryo)
    (artifact_at cs2 cryo)

    (connected entrance tunnel)
    (connected tunnel entrance)
    (connected tunnel cryo)
    (connected cryo tunnel)
    (connected tunnel pod1)
    (connected pod1 tunnel)
    (connected tunnel pod2)
    (connected pod2 tunnel)
    (connected tunnel hallA)
    (connected hallA tunnel)
    (connected tunnel hallB)
    (connected hallB tunnel)
    (connected tunnel stasis)
    (connected stasis tunnel)
  )
  (:goal (and
    (artifact_at a1 cryo)
    (artifact_at a2 cryo)
    (artifact_at b1 pod1)
    (artifact_at b2 pod2)
    (artifact_at cs1 stasis)
    (artifact_at cs2 stasis)
  ))
)

; plan
1. (move entrance tunnel)
   deleted: (robot_at entrance)
   added: (robot_at tunnel)
   goals met: 0 of 6
2. (move tunnel halla)
   deleted: (robot_at tunnel)
   added: (robot_at halla)
   goals met: 0 of 6
3. (load r1 a1 halla)
   deleted: (empty r1) (artifact_at a1 halla)
   added: (robot_carrying a1)
   goals met: 0 of 6
4. (move halla tunnel)
   deleted: (robot_at halla)
   added: (robot_at tunnel)
   goals met: 0 of 6
5. (move tunnel cryo)
   deleted: (robot_at tunnel)
   added: (robot_at cryo)
   goals met: 0 of 6
6. (unload r1 a1 cryo)
   deleted: (robot_carrying a1)
   added: (empty r1) (artifact_at a1 cryo)
   goals met: 1 of 6
7. (load r1 cs1 cryo)
   deleted: (empty r1) (artifact_at cs1 cryo)
   added: (robot_carrying cs1)
   goals met: 1 of 6
8. (move cryo tunnel)
   deleted: (robot_at cryo)
   added: (robot_at tunnel)
   goals met: 1 of 6
9. (move tunnel stasis)
   deleted: (robot_at tunnel)
   added: (robot_at stasis)
   goals met: 1 of 6
10. (unload r1 cs1 stasis)
   deleted: (robot_carrying cs1)
   added: (empty r1) (artifact_at cs1 stasis)
   goals met: 2 of 6
11. (move stasis tunnel)
   deleted: (robot_at stasis)
   added: (robot_at tunnel)
   goals met: 2 of 6
12. (move tunnel halla)
   deleted: (robot_at tunnel)
   added: (robot_at halla)
   goals met: 2 of 6
13. (load r1 a2 halla)
   deleted: (empty r1) (artifact_at a2 halla)
   added: (robot_carrying a2)
   goals met: 2 of 6
14. (move halla tunnel)
   deleted: (robot_at halla)
   added: (robot_at tunnel)
   goals met: 2 of 6
15. (move tunnel cryo)
   deleted: (robot_at tunnel)
   added: (robot_at cryo)
   goals met: 2 of 6
16. (unload r1 a2 cryo)
   deleted: (robot_carrying a2)
   added: (empty r1) (artifact_at a2 cryo)
   goals met: 3 of 6
17. (load r1 cs2 cryo)
   deleted: (empty r1) (artifact_at cs2 cryo)
   added: (robot_carrying cs2)
   goals met: 3 of 6
18. (move cryo tunnel)
   deleted: (robot_at cryo)
   added: (robot_at tunnel)
   goals met: 3 of 6
19. (move tunnel stasis)
   deleted: (robot_at tunnel)
   added: (robot_at stasis)
   goals met: 3 of 6
20. (unload r1 cs2 stasis)
   deleted: (robot_carrying cs2)
   added: (empty r1) (artifact_at cs2 stasis)
   goals met: 4 of 6
21. (move stasis tunnel)
   deleted: (robot_at stasis)
   added: (robot_at tunnel)
   goals met: 4 of 6
22. (move tunnel hallb)
   deleted: (robot_at tunnel)
   added: (robot_at hallb)
   goals met: 4 of 6
23. (load r1 b1 hallb)
   deleted: (empty r1) (artifact_at b1 hallb)
   added: (robot_carrying b1)
   goals met: 4 of 6
24. (move hallb tunnel)
   deleted: (robot_at hallb)
   added: (robot_at tunnel)
   goals met: 4 of 6
25. (move tunnel pod1)
   deleted: (robot_at tunnel)
   added: (robot_at pod1)
   goals met: 4 of 6
26. (unload r1 b1 pod1)
   deleted: (robot_carrying b1)
   added: (empty r1) (artifact_at b1 pod1)
   goals met: 5 of 6
27. (move pod1 tunnel)
   deleted: (robot_at pod1)
   added: (robot_at tunnel)
   goals met: 5 of 6
28. (move tunnel hallb)
   deleted: (robot_at tunnel)
   added: (robot_at hallb)
   goals met: 5 of 6
29. (load r1 b2 hallb)
   deleted: (empty r1) (artifact_at b2 hallb)
   added: (robot_carrying b2)
   goals met: 5 of 6
30. (move hallb tunnel)
   deleted: (robot_at hallb)
   added: (robot_at tunnel)
   goals met: 5 of 6
31. (move tunnel pod2)
   deleted: (robot_at tunnel)
   added: (robot_at pod2)
   goals met: 5 of 6
32. (unload r1 b2 pod2)
   deleted: (robot_carrying b2)
   added: (empty r1) (artifact_at b2 pod2)
   goals met: 6 of 6
